#+TITLE: Packet Terraform

** Init
Initialize the local environment:
#+begin_src shell
  terraform init
#+end_src

#+RESULTS:
#+begin_example

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "packet" (terraform-providers/packet) 3.0.1...
- Downloading plugin for provider "random" (hashicorp/random) 2.3.0...
- Downloading plugin for provider "template" (hashicorp/template) 2.1.2...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

,* provider.packet: version = "~> 3.0"
,* provider.random: version = "~> 2.3"
,* provider.template: version = "~> 2.1"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
#+end_example

** Plan
Plan and ensure that the resources to create are correct:
#+begin_src shell :async yes
  terraform plan
#+end_src

#+RESULTS:
#+begin_example
#+end_example

